

### 客户端编号

```
> CLIENT ID
> (integer) 9
```



### 客户端名称

```
> CLIENT SETNAME myCli
> OK
> CLIENT GETNAME
> "myCli"
```



### 列出当前客户端所在节点的所有客户端

[参数说明]: https://redis.io/commands/client-list	"CLIENT LIST"

```
CLIENT LIST [TYPE normal|master|replica|pubsub]

> CLIENT LIST
id=4 addr=127.0.0.1:33323 fd=10 name= age=10979 idle=0 flags=S db=0 sub=0 psub=0 multi=-1 qbuf=0 qbuf-free=32768 obl=0 oll=0 omem=0 events=r cmd=replconf
id=9 addr=127.0.0.1:49472 fd=21 name=myCli age=5640 idle=7 flags=N db=0 sub=0 psub=0 multi=-1 qbuf=0 qbuf-free=0 obl=0 oll=0 omem=0 events=r cmd=client
id=17 addr=127.0.0.1:49502 fd=22 name= age=3 idle=0 flags=N db=0 sub=0 psub=0 multi=-1 qbuf=26 qbuf-free=32742 obl=0 oll=0 omem=0 events=r cmd=client

> CLIENT LIST type replica
id=4 addr=127.0.0.1:33323 fd=10 name= age=11404 idle=0 flags=S db=0 sub=0 psub=0 multi=-1 qbuf=0 qbuf-free=0 obl=0 oll=0 omem=0 events=r cmd=replconf


id：唯一的64位客户端ID（在Redis 2.8.12中引入）。
name：客户端使用CLIENT SETNAME设置的名称
addr：客户端的地址/端口
fd：套接字对应的文件描述符
age：连接的总持续时间（以秒为单位）
idle：连接的空闲时间（以秒为单位）
flags：客户标志（请参见下文）
db：当前数据库ID
sub：频道订阅数
psub：模式匹配订阅数
multi：MULTI / EXEC上下文中的命令数
qbuf：查询缓冲区长度（0表示没有查询挂起）
qbuf-free：查询缓冲区的可用空间（0表示缓冲区已满）
obl：输出缓冲区长度
oll：输出列表长度（缓冲区已满时，答复在此列表中排队）
omem：输出缓冲区的内存使用情况
events：文件描述符事件（见下文）
cmd：最后播放的命令

客户端标志可以是以下各项的组合：
A: connection to be closed ASAP
b: the client is waiting in a blocking operation
c: connection to be closed after writing entire reply
d: a watched keys has been modified - EXEC will fail
i: the client is waiting for a VM I/O (deprecated)
M: the client is a master
N: no specific flag set
O: the client is a client in MONITOR mode
P: the client is a Pub/Sub subscriber
r: the client is in readonly mode against a cluster node
S: the client is a replica node connection to this instance
u: the client is unblocked
U: the client is connected via a Unix domain socket
x: the client is in a MULTI/EXEC context

文件描述符事件可以是：
r: the client socket is readable (event loop)
w: the client socket is writable (event loop)
```



### 暂停客户端

[参数说明]: https://redis.io/commands/client-pause	"CLIENT PAUSE"

```
CLIENT PAUSE timeout

单位毫秒
```



### 解锁客户端

[参数说明]: https://redis.io/commands/client-unblock	"CLIENT UNBLOCK"

```
CLIENT UNBLOCK client-id [TIMEOUT|ERROR]

> CLIENT UNBLOCK 2934
> 1
```



### 关闭客户端

[参数说明]: https://redis.io/commands/client-kill	"KILL CLIENT"

```
CLIENT KILL [ip:port] [ID client-id] [TYPE normal|master|slave|replica|pubsub] [ADDR ip:port] [SKIPME yes/no]

> CLIENT KILL id 6
> (integer) 1
> CLIENT KILL addr 127.0.0.1:49500
> (integer) 1

```

Note：

```
CLIENT KILL：该命令只能杀死客户端所在节点的其他客户端
SKIPME yes：跳过自己的客户端
```

